org/2014-1-15-maven-exception.org
#+STARTUP:showall
#+TITLE:Maven 常见异常总结
#+DATE:<2014-01-15 周三>
#+AUTHOR:Sylvan.Li
#+EMAIL:sylvan9527@gmail.com
#+STYLE:<link ref="stylesheet" type="text/css" href="../stylesheet/worg.css">

#+BEGIN_HTML
---
layout: default
title: Maven 常见异常总结
---
#+END_HTML


* Could not find artifact com.sun:tools:jar:1.5.0

  Could not find artifact com.sun:tools:jar:1.5.0 at specified path
  D:\Program Files\Java\jre/../lib/tools.jar 

  查看项目中的JRE设置是否由JDK换成了JRE，解决方案:在POM文件中加入

#+BEGIN_SRC xml

    <properties>  
        <java.home>D:\Program Files\Java\jdk1.6.0_10</java.home> <!-- 指定使用的JDK的安装目录 --> 
    </properties>  
      <dependency>  
            <groupId>com.sun</groupId>  
            <artifactId>tools</artifactId>  
            <version>1.6.0</version>  
            <scope>system</scope>  
            <systemPath>${java.home}/lib/tools.jar</systemPath>  
        </dependency>  

#+END_SRC
