blog/_posts/2014/2014-1-15-maven-exception.html
---
layout: default
title: Maven 常见异常总结
---



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Could not find artifact com.sun:tools:jar:1.5.0</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Could not find artifact com.sun:tools:jar:1.5.0</h2>
<div class="outline-text-2" id="text-1">


<p>
  Could not find artifact com.sun:tools:jar:1.5.0 at specified path
  D:\Program Files\Java\jre/../lib/tools.jar 
</p>
<p>
  查看项目中的JRE设置是否由JDK换成了JRE，解决方案:在POM文件中加入
</p>



<pre class="example">
&lt;properties&gt;  
    &lt;java.home&gt;D:\Program Files\Java\jdk1.6.0_10&lt;/java.home&gt; &lt;!-- 指定使用的JDK的安装目录 --&gt; 
&lt;/properties&gt;  
  &lt;dependency&gt;  
        &lt;groupId&gt;com.sun&lt;/groupId&gt;  
        &lt;artifactId&gt;tools&lt;/artifactId&gt;  
        &lt;version&gt;1.6.0&lt;/version&gt;  
        &lt;scope&gt;system&lt;/scope&gt;  
        &lt;systemPath&gt;${java.home}/lib/tools.jar&lt;/systemPath&gt;  
    &lt;/dependency&gt;  

</pre>

</div>
</div>
